import hero1Img from "./assets/hero1.png";
import hero2Img from "./assets/hero2.png";
import hero3Img from "./assets/hero3.png";

import step1Img from "./assets/step1.png";
import step2Img from "./assets/step2.png";
import step3Img from "./assets/step3.png";
import step4Img from "./assets/step4.png";

import prof1Img from "./assets/profesor1.png";
import prof2Img from "./assets/prof2.png";
import prof3Img from "./assets/prof3.png";
import prof4Img from "./assets/prof4.png";
import prof5Img from "./assets/prof5.png";
import prof6Img from "./assets/prof6.png";

import flag1Img from "./assets/flag1.png";
import flag2Img from "./assets/flag2.png";
import flag3Img from "./assets/flag3.png";
import flag4Img from "./assets/flag4.png";
import flag5Img from "./assets/flag5.png";

export const heroes = [
  {
    color: "#ed1b31",
    headline: "Основно образование",
    subheadline:
      "Дали Вашето дете го започна својот пат до квалитетна едукација?",
    description:
      "Во Study Shuttle, разбираме колку е важно да се постават цврсти темели и да се вроди доживотна љубов кон учењето кај децата. Нашата платформа нуди индивидуални часови приспособени за децата од основно училиште, водејќи ги кон академски успех во поддржувачка и интерактивна средина.",
    image: hero1Img,
  },
  {
    color: "#48badd",
    headline: "Средно образование",
    subheadline:
      "Отклучете го целосниот потенцијал на Вашиот тинејџер со Study Shuttle!",
    description:
      "Како родител на средношколец, го разбирате значењето на подготовката за предизвиците што претстојат. Study Shuttle е тука да го поттикне вашиот тинејџер со алатките и знаењето што им се потребни за да се истакнат во нивните студии и пошироко.",
    image: hero2Img,
  },
  {
    color: "#ffd02f",
    headline: "Високо образование",
    subheadline:
      "Курсеви за брзо учење специјализирани за потребите на студентите!",
    description:
      "Универзитетскиот живот може да бара многу, а понекогаш ви треба помош да го совладате матријалот за колоквиум или испит во краток временски период. Study Shuttle нуди курсеви за брзо учење, дизајнирани да ви помогнат да го совладате материјалот и да положите!",
    image: hero3Img,
  },
];

export const flagHeroData = [
  {
    title: "Добредојдовте во Study Shuttle",
    description:
      "Нашата платформа нуди индивидуални часови приспособени за децата од основно и средно училиште, и универзитет водејќи ги кон академски успех во поддржувачка и интерактивна средина.",
    image: flag1Img,
    color: "#ed1b31",
  },
  {
    title: "Родителска Вклученост",
    description:
      "Study Shuttle ги охрабрувародителите активно да учествуваат во учењето на нивното дете преку алатките за следенье на напредокот и насоки за ефикасна поддршка од нашите професори.",
    image: flag2Img,
    color: "#ffd02f",
  },
  {
    title: "Брзи курсеви за студенти",
    description:
      "Високо-квалификуваните професори обезбедуваат специализирани курсеви за брзо ученье, помагаки им на студентите да ги совладаат предметите и да ги положат испитите.",
    image: flag3Img,
    color: "#48badd",
  },
  {
    title: "Интерактивни алатки за учење",
    description:
      "Учењето никогаш не било толку лесно и забавно. Со помош на овие алатки, учениците и родителите ќе знаат точно на што да се посветат со цел да го совладаат материалот.",
    image: flag4Img,
    color: "#ed1b31",
  },
  {
    title: "Менторски пристап",
    description:
      "Му помагаме на Вашето дете да се стекне со знаење и вештини во посакуваната област, да постави SMART цели, да биде одговорен према целите и да стекне лидерски вештини и самодоверба.",
    image: flag5Img,
    color: "#ffd02f",
  },
];

export const stepsData = [
  {
    title: "Чекор 1",
    subtitle: "Регистрај се",
    description:
      "Кликни на копчето “Регистрирај се” и пополни ја формата за да направиш профил на страната.",
    image: step1Img,
  },
  {
    title: "Чекор 2",
    subtitle: "Одбери го Пакетот кој најмногу ти одговара",
    description:
      "Откога ќе се регистрираш, одбери план за часови и отвори ја е-мејл адресата каде ќе добиеш упатство за уплата. За секој час уплатен, ќе добиеш 1 токен и запомни:",
    image: step2Img,
  },
  {
    title: "Чекор 3",
    subtitle: "Одбери Професор",
    description:
      "Одбери еден од професорите што држи настава по посакуваниот предмет и закажи си час! Откога ќе кликнеш на иконата на професорот, ќе те донесе до неговиот профил каде ќе можеш да ги прочиташ основните информации. ",
    image: step3Img,
  },
  {
    title: "Чекор 4",
    subtitle: "Закажи Термин",
    description:
      "Одбери на еден од термините обележани со сина боја, пополни ги информациите потребни за да го закажеш часот и погрижи се да ја имаш платформата Microsoft Teams инсталирано и ажурирано на уредот кој ќе го користиш за слушање на наставата.",
    image: step4Img,
  },
];

export const proffesorsData = [
  {
    name: "Александар Пенчиќ",
    title: "Тутор на студентите од ФИНКИ",
    scope: "Основно и Средно образование:",
    filters: ["основно", "средно", "универзитет"],
    subjects: ["Програмски Јазици", "Математика"],
    image: prof1Img,
  },
  {
    name: "Љопче Ричлиева",
    title: "Професор по Француски Јазик",
    scope: "Основно и Средно образование:",
    filters: ["основно", "средно"],
    subjects: ["Програмски Јазици", "Математика"],
    image: prof2Img,
  },
  {
    name: "Маја Хаџиева Гиговска",
    title: "Тутор на студентите од Фармацевтски Факултет",
    scope: "Основно и Средно образование:",
    filters: ["основно", "средно", "универзитет"],
    subjects: ["Биологија", "Хемија"],
    image: prof3Img,
  },
  {
    name: "Бисера Пешлинковска",
    title: "Тутор на студентите од Економски Факултет",
    scope: "Основно и Средно образование:",
    filters: ["основно", "средно", "универзитет"],
    subjects: ["Германски јазик", "Економски стручни предмети"],
    image: prof4Img,
  },
  {
    name: "Ристе Казиев",
    title: "Тутор на студентите од Англиска литература и книжевност",
    scope: "Основно и Средно образование:",
    filters: ["основно", "средно", "универзитет"],
    subjects: ["Англиски јазик"],
    image: prof5Img,
  },
  {
    name: "Андреј Илиевски",
    title: "Тутор на студентите од ФИНКИ",
    scope: "Основно и Средно образование:",
    filters: ["основно", "средно"],
    subjects: ["Физика", "Математика"],
    image: prof6Img,
  },
];
